// SPDX-License-Identifier: MIT
pragma solidity ^0.8.19;

import {Script} from "forge-std/Script.sol";

/*
    Он решает простую, но важную задачу:
    👉 Автоматически выбирает нужный приватный ключ для выполнения транзакции, в зависимости от сети.

    block.chainid — это ID текущей сети, в которой выполняется скрипт.


    | Сеть     | Chain ID | Описание                                |
    | -------- | -------- | --------------------------------------- |
    | 11155111 | Sepolia  | Ethereum тестовая сеть                  |
    | 31337    | Anvil    | Локальная сеть (по умолчанию в Foundry) |


    0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80
    - Это дефолтный приватный ключ из локальной сети Anvil (он создаётся Foundry автоматически при запуске anvil).
    🔸 В Foundry у anvil по умолчанию 10 тестовых аккаунтов, и первый из них имеет как раз этот приватный ключ.

    Когда Helper нужен

    Он становится полезным, когда ты хочешь, чтобы один и тот же скрипт работал и на локальной сети (Anvil), и на тестовой сети (Sepolia),
    без изменения аргументов командной строки. Например, вместо длинной команды ты просто пишешь:

    forge script script/UpgradeCounter.s.sol:UpgradeCounter --broadcast --rpc-url $SEPOLIA_RPC

    А в коде:

    uint256 deployerKey = _getDeployerKey();
    vm.startBroadcast(deployerKey);

    И тогда:

    - если ты работаешь локально (chainid = 31337), — используется дефолтный тестовый ключ Anvil;
    - если ты работаешь в Sepolia (chainid = 11155111), — ключ берётся из .env (PRIVATE_KEY=...).

    Когда ты передаёшь параметр:
    --private-key $PRIVATE_KEY

    Foundry делает следующее:

    - Запускает скрипт.
    - Подменяет поведение vm.startBroadcast() — теперь она автоматически использует переданный приватный ключ.
    - Поэтому внутри кода тебе не нужно вручную вызывать _getDeployerKey() и передавать его в vm.startBroadcast().
*/
contract Helper is Script {
    function _getDeployerKey() internal view returns (uint256) {
        if (block.chainid == 11155111) { // If the script is running in the Sepolia
            return vm.envUint("PRIVATE_KEY"); // use real PRIVATE_KEY from the .env file (source ./.env should be executed before).
        } else {
            return 0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80; // Anvil (from Foundry) local default private key.
        }
    }
}
